_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ОбменДаннымиВФорматеГектор5D.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_ОбменДаннымиВФорматеГектор5D</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СметнаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновитьПоВнешнейБазе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновитьПоКорпоративнойБазе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СметноНормативнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметноНормативныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ТерриториальныеРайоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_Файлы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ИсточникиДобавленияПозиций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ИсточникиДобавленияПозиций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НормативныеСборники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяНормативнаяБаза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ресурсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборникТекущихЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EXCEL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загружена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Скопирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыПоправок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыПоправок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДемонтажМДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УсловияПроизводстваРаботМДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехчастиСборников</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВариантыРасчетаЭММ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВариантыРасчетаЭММ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Одинаковые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазныеКРазности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыНормативныхСборников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыНормативныхСборников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтроительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПусконаладочныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РемонтноСтроительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеставрационноВосстановительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническоеОбслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СметныеЦеныНаМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СметныеЦеныНаЭксплуатациюМашин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогШтучныхКонструкций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прейскурант0608НаСборныйЖелезобетон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрейскурантыНаРемонтТехнологическогоОборудования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрейскурантОптовыхЦенНаМатериалыИОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦеныНаМестныеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УкрупненныеСметныеНормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перебазировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеЗатратыВЗимнееВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СодержаниеОбъектовГородскойСреды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременныеЗданияИСооружения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Калькуляция</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРасценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРасценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МебельИнвентарь</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_РазделЛокальнойСметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_РазделЛокальнойСметы</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Comment>Внутренний код</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРодителя</Name>
					<Comment>Внутренний код</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДСметы</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректируетРаздел</Name>
					<Comment>Корректируемый раздел</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффОборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффОснЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффПолнСтоимРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимЗарплатеМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимМатериалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВДереве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВПределахСметы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_РазделыЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНРТекущая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСПТекущая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_Конструктив.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_Конструктив</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СМ_ОбъектыСтроительства</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонструктива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_BIM_ТипыКонструктивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ОбменДаннымиВФорматеГектор5D/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗапуститьСозданиеДокументов(СтруктураПараметров) Экспорт

	СформироватьДакументыГектор5D(СтруктураПараметров,Новый УникальныйИдентификатор);
	
КонецПроцедуры	

Функция ЗапуститьСозданиеДокументовРегламент(СтруктураПараметров) Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Создание документов Гектор 5D'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Результат = ДлительныеОперации.ВыполнитьВФоне("Обработки.СМ_ОбменДаннымиВФорматеГектор5D.СформироватьДакументыГектор5D", СтруктураПараметров, ПараметрыВыполнения);

	Возврат Результат;

КонецФункции	

Процедура СформироватьДакументыГектор5D(СтруктураПараметровЗадания,АдресХранилища) Экспорт
	
	СтруктурныйТип 		= ФабрикаXDTO.Тип("urn:Gektor5D", "Document"); 
	ИмяВременногоФайла 	= ПолучитьИмяВременногоФайла();
	ПутьКФайлу 			= СтруктураПараметровЗадания.ПутьКФайлу;
	Запись 				= РегистрыСведений.СМ_Файлы.Выбрать(Новый Структура("ИмяФайла",ПутьКФайлу)); 
	Запись.Следующий();
	
	ДвоичныеДанные = Запись.Файл.Получить();
	ДвоичныеДанные.Записать(ИмяВременногоФайла);

	МассивФайла = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПутьКФайлу,"\");
	КолвоЧастей = МассивФайла.Количество();
	Если КолвоЧастей > 0 Тогда
		НаименованиеСметы = "Смета из файла Гектор 5D " + МассивФайла[КолвоЧастей-1];
	Иначе
		НаименованиеСметы = "Смета из файла Гектор 5D";
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
	
	ФайлОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML,СтруктурныйТип);
	
	// Создание таблиц значений

	// ******************************************************************
	// Elements - это конструкция сооружения (типа стена или водопровод).
	ТабКонструкции = Новый ТаблицаЗначений;
	ТабКонструкции.Колонки.Добавить("НаименованиеКатегории");
	ТабКонструкции.Колонки.Добавить("ИдКатегории");
	ТабКонструкции.Колонки.Добавить("НаименованиеГруппы");
	ТабКонструкции.Колонки.Добавить("НаименованиеТипа");
	ТабКонструкции.Колонки.Добавить("ИдТипа");
	ТабКонструкции.Колонки.Добавить("ИдРодителя"); 

	// ******************************************************************
	// Code 	- шифр позиции.
	// NormType - тип нормативного сборника позиции.
	// Name 	- наименование позиции.
	// Unit 	- измеритель позиции.
	// Formula 	- формула объема.
	// Volume 	- Объем работ позиции.
	
	ТабПозиции = Новый ТаблицаЗначений;
	ТабПозиции.Колонки.Добавить("КодПозиции");
	ТабПозиции.Колонки.Добавить("ТипНормативногоСборника");
	ТабПозиции.Колонки.Добавить("Наименование");
	ТабПозиции.Колонки.Добавить("Измеритель");
	ТабПозиции.Колонки.Добавить("ФормулаОбъема");
	ТабПозиции.Колонки.Добавить("ОбъемРабот");
	ТабПозиции.Колонки.Добавить("ИдКонструкции");
	ТабПозиции.Колонки.Добавить("НазваниеКатегории");
	
	// **************************************************************
	// Resource 	- загружаем как позицию привязанную к вышестоящей Norm.
	// Code 		- шифр позиции.
	// Name 		- наименование позиции.
	// Unit 		- измеритель позиции.
	// Basecode 	- записать в примечание позиции.
	// Norm 		- Норма расхода позиции.
	// Formula 		- формула объема.
	// Fnorm 		- Объем работ позиции.
	
	ТабРесурсы = Новый ТаблицаЗначений;
	ТабРесурсы.Колонки.Добавить("КодРесурса");
	ТабРесурсы.Колонки.Добавить("Наименование");
	ТабРесурсы.Колонки.Добавить("БазовыйКод");
	ТабРесурсы.Колонки.Добавить("Измеритель");
	ТабРесурсы.Колонки.Добавить("НормаРасхода");
	ТабРесурсы.Колонки.Добавить("ФормулаОбъема");
	ТабРесурсы.Колонки.Добавить("ОбъемРаботПозиции");
	ТабРесурсы.Колонки.Добавить("КодПозиции");
	
	// *********************************************************************	
	// Correction грузить в ТЧ поправок
	// Code 			- обоснование.
	// Name 			- наименование. 
	// Reason 			- условия применения.
	// Salary           - Коэффициент к основной зарплате.
	// Machine          - Коэффициент к эксплуатации машин и механизмов.
 	// Material			- Коэффициент к стоимости материалов.
	// Labor            - Коэффициент к затратам труда рабочих.
	// LaborMachinist   - Коэффициент к затратам труда машинистов.
	// Machinist        - Коэффициент к зарплате машинистов.

	ТабПоправки =  Новый ТаблицаЗначений;
	ТабПоправки.Колонки.Добавить("КодПоправки");
	ТабПоправки.Колонки.Добавить("Наименование");
	ТабПоправки.Колонки.Добавить("УсловияПрименения");
	ТабПоправки.Колонки.Добавить("КодПозиции"); 
	ТабПоправки.Колонки.Добавить("КоэффОЗ"); // Salary
	ТабПоправки.Колонки.Добавить("КоэффЭМ"); // Machine
	ТабПоправки.Колонки.Добавить("КоэффСМ"); // Material
	ТабПоправки.Колонки.Добавить("КоэффТР"); // Labor
	ТабПоправки.Колонки.Добавить("КоэффТМ"); // LaborMachinist
	ТабПоправки.Колонки.Добавить("КоэффЗМ"); // Machinist

	// *****************************************************************
	// Загрузка конструктивных элементов.
	СписокЭлементов = ФайлОбъектXDTO.Elements.ПолучитьСписок("Element");
	Для Каждого ТекЭлемент Из СписокЭлементов Цикл

		// Заполнение категорий.
		НоваяСтрока 						= ТабКонструкции.Добавить();
		НоваяСтрока.НаименованиеКатегории	= ТекЭлемент.CategoryName;
		НоваяСтрока.ИдКатегории				= ТекЭлемент.CategoryId;
		НоваяСтрока.НаименованиеГруппы		= ТекЭлемент.FamilyName;
		НоваяСтрока.НаименованиеТипа		= ТекЭлемент.TypeName;
		НоваяСтрока.ИдТипа					= ТекЭлемент.Id;
		НоваяСтрока.ИдРодителя				= "";
		
		Если ТекЭлемент.Свойства().Получить("ИдРодителя") <> Неопределено Тогда
			НоваяСтрока.ИдРодителя = ТекЭлемент.ParentId;
		КонецЕсли;
		
		НаименованиеКатегории	= ТекЭлемент.CategoryName;
		ИдКонструкции			= ТекЭлемент.Id;

		// Получение позиций, их может и не быть.
		Если ТекЭлемент.Свойства().Получить("Norms") <> Неопределено Тогда
			Если ТипЗнч(ТекЭлемент.Norms.Norm) = Тип("СписокXDTO") Тогда
				Для Каждого ТекПозиция Из ТекЭлемент.Norms.Norm Цикл
					ДобавитьСтрокуПозиции(ТабПозиции,ТабРесурсы,ТабПоправки,ТекПозиция,НаименованиеКатегории,ИдКонструкции);
				КонецЦикла;
			Иначе
				ТекПозиция = ТекЭлемент.Norms.Norm;
				ДобавитьСтрокуПозиции(ТабПозиции,ТабРесурсы,ТабПоправки,ТекПозиция,НаименованиеКатегории,ИдКонструкции);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// ******************************************************************
	ТабСвязиПозиций = ТабПозиции.Скопировать();
	ТабРазделы 		= ТабКонструкции.Скопировать();
	ТабРазделы.Свернуть("НаименованиеКатегории");
	ТабПозиции.Свернуть("КодПозиции,ТипНормативногоСборника,Наименование,Измеритель,ФормулаОбъема,НазваниеКатегории","ОбъемРабот");
	ТабРесурсы.Свернуть("КодРесурса,Наименование,БазовыйКод,Измеритель,НормаРасхода,ФормулаОбъема,КодПозиции","ОбъемРаботПозиции");
	ТабПоправки.Свернуть("КодПоправки,Наименование,УсловияПрименения,КодПозиции,КоэффОЗ,КоэффЭМ,КоэффСМ,КоэффТР,КоэффТМ,КоэффЗМ");	
	
	// *************************************************************************
	// Создание элементов справочника конструкций. 
	Для Каждого ТекСтрока Из ТабКонструкции Цикл
		СоздатьКонструктив(ТекСтрока,СтруктураПараметровЗадания.Стройка);
	КонецЦикла;
	
	// *************************************************************************
	// Заполнение структуры данных.
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ТабКонструкции",ТабКонструкции);
	СтруктураДанных.Вставить("ТабПозиции",ТабПозиции);
	СтруктураДанных.Вставить("ТабСвязиПозиций",ТабСвязиПозиций);
	СтруктураДанных.Вставить("ТабРазделы",ТабРазделы);
	СтруктураДанных.Вставить("ТабРесурсы",ТабРесурсы);
	СтруктураДанных.Вставить("ТабПоправки",ТабПоправки);
	СтруктураДанных.Вставить("СтруктураПараметров",СтруктураПараметровЗадания);
	
	МассивПозиций = Новый Массив;
	СтруктураДанных.Вставить("МассивПозиций",МассивПозиций);

	МассивСообщений = Новый Массив;
	СтруктураДанных.Вставить("МассивСообщений",МассивСообщений);
	
	// ******************************************
	// Создание документа смета.
	НоваяСмета 							= Документы.СМ_ЛокальнаяСмета.СоздатьДокумент();
	НоваяСмета.НомерСметы 				= 21;
	НоваяСмета.Наименование 			= НаименованиеСметы;
	НоваяСмета.Дата						= ПреобразоватьФорматДаты(ФайлОбъектXDTO.DateTime);
	НоваяСмета.Организация				= СтруктураПараметровЗадания.Организация;
	НоваяСмета.Стройка					= СтруктураПараметровЗадания.Стройка;
	НоваяСмета.Район					= СтруктураПараметровЗадания.Район;
	НоваяСмета.Заказчик 				= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнойЗаказчик");
	НоваяСмета.Подрядчик 				= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнойПодрядчик");
	НоваяСмета.Инвестор 				= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнойИнвестор");
	НоваяСмета.МетодикаРасчета  		= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнаяМетодикаРасчета");
	
	СМ_АРПС_ОбменВызовСервера.ЗаполнитьИзНастроекПользователяПоУмолчанию(НоваяСмета);
	СМ_СметныйСоставВызовСервера.ПеренумероватьДерево(НоваяСмета);
	НоваяСмета.Записать(РежимЗаписиДокумента.Проведение);
	
	// ****************************************
	// Запись в таблицу сообщений.
	ТекстСообщения = "Создан новый документ - " + Строка(НоваяСмета);
	СтруктураДанных.МассивСообщений.Добавить(ТекстСообщения);
	
	// ****************************************
	// Создание разделов.
	СоздатьРазделы(СтруктураДанных,НоваяСмета);
	
	// ****************************************
	// Вывод сообщений.
	Для Каждого ТекСообщение Из СтруктураДанных.МассивСообщений Цикл
	    Сообщение 		= Новый СообщениеПользователю();
	    Сообщение.Текст = ТекСообщение;
	    Сообщение.Сообщить();
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("МассивПозиций",СтруктураДанных.МассивПозиций);
	СтруктураВозврата.Вставить("МассивСообщений",СтруктураДанных.МассивСообщений);
	
	ПоместитьВоВременноеХранилище(СтруктураВозврата,АдресХранилища); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСтрокуПозиции(ТабПозиции,ТабРесурсы,ТабПоправки,ОбъектПозиция,НазваниеКатегории,ИдКонструкции)
	
	СтрокаПозиции 							= ТабПозиции.Добавить();
	СтрокаПозиции.КодПозиции             	= ОбъектПозиция.Code;
	СтрокаПозиции.ТипНормативногоСборника   = ОбъектПозиция.NormType;
	СтрокаПозиции.Наименование				= ОбъектПозиция.Name;
	СтрокаПозиции.Измеритель				= ОбъектПозиция.Unit;
	СтрокаПозиции.ФормулаОбъема				= ОбъектПозиция.Formula;
	СтрокаПозиции.ОбъемРабот 				= 0;	
	СтрокаПозиции.ИдКонструкции				= ИдКонструкции;
	СтрокаПозиции.НазваниеКатегории		 	= НазваниеКатегории;

	Если ОбъектПозиция.Свойства().Получить("Volume") <> Неопределено Тогда
		СтрокаПозиции.ОбъемРабот = Число(ОбъектПозиция.Volume);
	КонецЕсли;

	// Заполнение строк ресурсов подчиненных позициям
	Если ОбъектПозиция.Свойства().Получить("Resources") <> Неопределено Тогда
		Если ТипЗнч(ОбъектПозиция.Resources.Resource) = Тип("СписокXDTO") Тогда
			Для Каждого ТекРесурс Из ОбъектПозиция.Resources.Resource Цикл
				ДобавитьСтрокуРесурса(ТабРесурсы,ТекРесурс,СтрокаПозиции.КодПозиции);
			КонецЦикла;
		Иначе
			ТекРесурс = ОбъектПозиция.Resources.Resource;
			ДобавитьСтрокуРесурса(ТабРесурсы,ТекРесурс,СтрокаПозиции.КодПозиции);
		КонецЕсли;
	КонецЕсли;
	
	// Заполнение строк поправок подчиненных позициям
	Если ОбъектПозиция.Свойства().Получить("Corrections") <> Неопределено Тогда
		Если ТипЗнч(ОбъектПозиция.Corrections.Correction) = Тип("СписокXDTO") Тогда
			Для Каждого ТекПоправка Из ОбъектПозиция.Corrections.Correction Цикл
				ДобавитьСтрокуПоправки(ТабПоправки,ТекПоправка,СтрокаПозиции.КодПозиции);
			КонецЦикла;
		Иначе
			ТекПоправка = ОбъектПозиция.Corrections.Correction;
			ДобавитьСтрокуПоправки(ТабПоправки,ТекПоправка,СтрокаПозиции.КодПозиции);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьСтрокуРесурса(ТабРесурсы,ОбъектРесурс,КодПозиции)
	
	НоваяСтрока 					= ТабРесурсы.Добавить();	
	НоваяСтрока.КодРесурса			= ОбъектРесурс.Code;
	НоваяСтрока.Наименование		= ОбъектРесурс.Name;
	НоваяСтрока.БазовыйКод			= ОбъектРесурс.Basecode;
	НоваяСтрока.Измеритель			= ОбъектРесурс.Unit;
	НоваяСтрока.НормаРасхода		= ОбъектРесурс.Norm;
	НоваяСтрока.ФормулаОбъема		= "";
	НоваяСтрока.ОбъемРаботПозиции	= 0;
	НоваяСтрока.КодПозиции			= КодПозиции;

	Если ОбъектРесурс.Свойства().Получить("Formula") <> Неопределено Тогда
		НоваяСтрока.ФормулаОбъема = ОбъектРесурс.Formula;
	КонецЕсли;	
	
	Если ОбъектРесурс.Свойства().Получить("Fnorm") <> Неопределено Тогда
		НоваяСтрока.ОбъемРаботПозиции = ОбъектРесурс.Fnorm;
	КонецЕсли;	

КонецПроцедуры

Процедура ДобавитьСтрокуПоправки(ТабПоправки,ОбъектПоправка,КодПозиции)
	
	// Пустые поправки не добавляем
	Если ОбъектПоправка.Свойства().Получить("Code") <> Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ОбъектПоправка.Code) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектПоправка.Свойства().Получить("Name") <> Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ОбъектПоправка.Name) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаПоправки 						= ТабПоправки.Добавить();
	СтрокаПоправки.КодПоправки			= "";
	СтрокаПоправки.Наименование			= "";
	СтрокаПоправки.УсловияПрименения 	= "";
	СтрокаПоправки.КодПозиции		 	= КодПозиции;
	СтрокаПоправки.КоэффОЗ				= 0;
	СтрокаПоправки.КоэффЭМ				= 0;
	СтрокаПоправки.КоэффСМ				= 0;
	СтрокаПоправки.КоэффТР				= 0;
	СтрокаПоправки.КоэффТМ				= 0;
	СтрокаПоправки.КоэффЗМ				= 0;
	
	Если ОбъектПоправка.Свойства().Получить("Name") <> Неопределено Тогда
		СтрокаПоправки.КодПоправки = ОбъектПоправка.Code;
	КонецЕсли;
	
	Если ОбъектПоправка.Свойства().Получить("Name") <> Неопределено Тогда
		СтрокаПоправки.Наименование	= ОбъектПоправка.Name;	
	КонецЕсли;
	
	Если ОбъектПоправка.Свойства().Получить("Reason") <> Неопределено Тогда
		СтрокаПоправки.УсловияПрименения = ОбъектПоправка.Reason;
	КонецЕсли;
	
	Если ОбъектПоправка.Свойства().Получить("Salary") <> Неопределено Тогда
		СтрокаПоправки.КоэффОЗ = Число(ОбъектПоправка.Salary);
	КонецЕсли;
	
	Если ОбъектПоправка.Свойства().Получить("Machine") <> Неопределено Тогда
		СтрокаПоправки.КоэффЭМ = Число(ОбъектПоправка.Machine);
	КонецЕсли;
	
	Если ОбъектПоправка.Свойства().Получить("Material") <> Неопределено Тогда
		СтрокаПоправки.КоэффСМ = Число(ОбъектПоправка.Material);
	КонецЕсли;
	
	Если ОбъектПоправка.Свойства().Получить("Labor") <> Неопределено Тогда
		СтрокаПоправки.КоэффТР = Число(ОбъектПоправка.Labor);
	КонецЕсли;
	
	Если ОбъектПоправка.Свойства().Получить("LaborMachinist") <> Неопределено Тогда
		СтрокаПоправки.КоэффТМ = Число(ОбъектПоправка.LaborMachinist);
	КонецЕсли;
	
	Если ОбъектПоправка.Свойства().Получить("Machinist") <> Неопределено Тогда
		СтрокаПоправки.КоэффЗМ = Число(ОбъектПоправка.Machinist);
	КонецЕсли;
	
КонецПроцедуры

Функция ПреобразоватьФорматДаты(ТекДата)
	
	// Формат даты: "22.06.2018 15:56:00"
	МассивДаты = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекДата," ");
	Если МассивДаты.Количество() = 2 Тогда
		СтрокаДата 	= МассивДаты[0];
		СтрокаВремя = МассивДаты[1];
		
		МассивДата 	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаДата,".");
		МассивВремя = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаВремя,":");
		
		Если МассивДата.Количество() = 3 Тогда
			ТекДень 	= Число(МассивДата[0]);
			ТекМесяц 	= Число(МассивДата[1]);
			ТекГод		= Число(МассивДата[2]);
		Иначе
			Событие = НСтр("ru = 'Ошибка разбора даты Гектор 5D'");
			СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);
			Возврат ТекущаяДата();
		КонецЕсли;
		
		Если МассивВремя.Количество() = 3 Тогда
			ТекЧас		= Число(МассивВремя[0]);
			ТекМинута 	= Число(МассивВремя[1]);
			ТекСекунда	= Число(МассивВремя[2]);
		Иначе
			Событие = НСтр("ru = 'Ошибка разбора даты Гектор 5D'");
			СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);
			Возврат ТекущаяДата();
		КонецЕсли;
		
		ДатаСметы = Дата(ТекГод,ТекМесяц,ТекДень,ТекЧас,ТекМинута,ТекСекунда);
		Возврат ДатаСметы;
	Иначе
		Событие = НСтр("ru = 'Ошибка разбора даты Гектор 5D'");
		СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);
		Возврат ТекущаяДата();
	КонецЕсли;
	
КонецФункции

Процедура СоздатьРазделы(СтруктураДанных,ТекСмета)
	
	Для Каждого ТекРаздел Из СтруктураДанных.ТабРазделы Цикл 
	
		НовыйРаздел 						= Документы.СМ_РазделЛокальнойСметы.СоздатьДокумент();
		НовыйРаздел.Расчет 					= Истина;
		НовыйРаздел.Дата 					= ТекСмета.Дата;
		НовыйРаздел.ИДРодителя 				= ТекСмета.Ссылка;
		НовыйРаздел.ИДСметы 				= ТекСмета.Ссылка;
		НовыйРаздел.НаименованиеДляПечати 	= ТекРаздел.НаименованиеКатегории;
		НовыйРаздел.Записать();
		
		// Запись в массив сообщений
		ТекстСообщения = "Создан новый раздел: " + НовыйРаздел.НаименованиеДляПечати;
		СтруктураДанных.МассивСообщений.Добавить(ТекстСообщения);

		// Создание позиций
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("НазваниеКатегории",ТекРаздел.НаименованиеКатегории);
		МассивПозиций = СтруктураДанных.ТабПозиции.НайтиСтроки(СтруктураОтбора);
		Для Каждого СтрокаПозиции Из МассивПозиций Цикл
			СоздатьПозицию(НовыйРаздел,ТекСмета,СтрокаПозиции,СтруктураДанных);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьПозицию(ТекРаздел, ТекСмета, СтрокаПозиции, СтруктураДанных)
	
	СтруктураПараметров = СтруктураДанных.СтруктураПараметров;
	
	НовыйПозиция 							= Документы.СМ_ПозицияЛокальнойСметы.СоздатьДокумент(); 
	НовыйПозиция.Дата 						= ТекСмета.Дата;
	НовыйПозиция.ИДСметы 					= ТекРаздел.ИДСметы;
	НовыйПозиция.ИДРодителя 				= ТекРаздел.Ссылка;
	НовыйПозиция.ШифрРасценки 				= СтрокаПозиции.КодПозиции;
	НовыйПозиция.ОбъемРабот 				= СтрокаПозиции.ОбъемРабот;
	НовыйПозиция.ФормулаОбъема				= СтрокаПозиции.ФормулаОбъема;
	НовыйПозиция.ТипНормативныхСборников	= СМ_BIM_ВызовСервера.ПреобразоватьТипНормативногоСборника(СтрокаПозиции.ТипНормативногоСборника);
	НовыйПозиция.РегиональнаяБаза			= СтруктураПараметров.СметноНормативнаяБаза;
	НовыйПозиция.Измеритель 				= СтрокаПозиции.Измеритель;
	НовыйПозиция.ЕдиницаИзмерения 			= СМ_СметаВызовСервера.НайтиЕдиницуИзмеренияПоСтроке(СтрокаПозиции.Измеритель);
	НовыйПозиция.СпособСоздания  			= Перечисления.СМ_ИсточникиДобавленияПозиций.Загружена;
	НовыйПозиция.ИсточникСоздания   		= "Гектор5D#XML";
	НовыйПозиция.Расчет 					= Истина;

	// Обновление позиции по НС.
	Если СтруктураПараметров.ОбновитьПоКорпоративнойБазе Тогда	
		// Поиск нормативного сборника, поиск производится по коду расценки, типу сборника, СНБ (Региональная база) позиции.
		// Если СНБ не заполнена, поиск производится без учета СНБ.
		НормативныйСборник = СМ_СметаВызовСервера.НайтиНормативныйСборник(НовыйПозиция.ТипНормативныхСборников,СтрокаПозиции.КодПозиции,НовыйПозиция.РегиональнаяБаза);
		Если ЗначениеЗаполнено(НормативныйСборник) Тогда
			НомерВДереве = "";
			СМ_СметаВызовСервера.ОбновитьПозициюПоНормативномуСборнику(НовыйПозиция,ТекСмета,ТекРаздел.Ссылка,НормативныйСборник);
			// НовыйПозиция.Записать();
		КонецЕсли;
	КонецЕсли;

	НовыйПозиция.Наименование = СтрокаПозиции.Наименование;
	НовыйПозиция.Определитель = Справочники.СМ_Определители.НайтиПоТипуНормативногоСборника(НовыйПозиция.ТипНормативныхСборников);
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("КодПозиции",СтрокаПозиции.КодПозиции);
	
	// ******************************************************
	// Заполнение поправок.
	МассивПоправок = СтруктураДанных.ТабПоправки.НайтиСтроки(СтруктураОтбора);
	Для Каждого ТекПоправка Из МассивПоправок Цикл
		НоваяСтрока 					= НовыйПозиция.ПоправкиПозиции.Добавить();
		НоваяСтрока.ТипПоправки 		= Перечисления.СМ_ТипыПоправок.ТехчастиСборников;
		НоваяСтрока.ВариантРасчета  	= Перечисления.СМ_ВариантыРасчетаЭММ.Одинаковые;
		НоваяСтрока.Обоснование         = ТекПоправка.КодПоправки;
		НоваяСтрока.Применить           = Истина;
		НоваяСтрока.УсловияПрименения   = ТекПоправка.УсловияПрименения;
		НоваяСтрока.Справка				= ТекПоправка.Наименование;
		НоваяСтрока.КоэффОЗ				= ТекПоправка.КоэффОЗ;	
		НоваяСтрока.КоэффЭМ				= ТекПоправка.КоэффЭМ;	
		НоваяСтрока.КоэффСМ				= ТекПоправка.КоэффСМ;	
		НоваяСтрока.КоэффТР				= ТекПоправка.КоэффТР;	
		НоваяСтрока.КоэффТМ				= ТекПоправка.КоэффТМ;	
		НоваяСтрока.КоэффЗМ				= ТекПоправка.КоэффЗМ;
	КонецЦикла;	
	
	// ******************************************************
	// Заполнение конструктивов.
	МассивСвязей = СтруктураДанных.ТабСвязиПозиций.НайтиСтроки(СтруктураОтбора);
	Для Каждого ТекСвязь Из МассивСвязей Цикл
		СтрокаКонструктив = НовыйПозиция.Конструктивы.Добавить();
		СтрокаКонструктив.Конструктив = Справочники.УСОERP_Конструктив.НайтиПоНаименованию(ТекСвязь.ИдКонструкции,Истина,,СтруктураПараметров.Стройка);
	КонецЦикла;
	
	// Обновление номера.
	Номера 			= СМ_СметаВызовСервера.ПолучитьНомерДокумента(НовыйПозиция);
	НомерВДереве	= Номера.НомерВДереве + 0.01;
	СМ_СметаВызовСервера.УстановитьНомерДокумента(НовыйПозиция.Ссылка,,,НомерВДереве,,"СМ_ПозицияЛокальнойСметы");
	НовыйПозиция.Записать();
			
	// Запись в массив сообщений.
	ТекстСообщения = "Создана позиция: " + НовыйПозиция + ", Раздел: " + НовыйПозиция.ИДРодителя;
	СтруктураДанных.МассивСообщений.Добавить(ТекстСообщения);
	СтруктураДанных.МассивПозиций.Добавить(НовыйПозиция.Ссылка);

	// ******************************************************
	// Создание позиций на основании ресурсов.
	МассивРесурсов = СтруктураДанных.ТабРесурсы.НайтиСтроки(СтруктураОтбора);
	Для Каждого ТекСтрока Из МассивРесурсов Цикл
		СоздатьПозициюРесурс(ТекРаздел, ТекСмета, НовыйПозиция.Ссылка, ТекСтрока, СтруктураДанных);
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьПозициюРесурс(ТекРаздел,ТекСмета,ТекПозиция,СтрокаПозиции, СтруктураДанных)
	
	НовыйПозиция 							= Документы.СМ_ПозицияЛокальнойСметы.СоздатьДокумент(); 
	НовыйПозиция.Расчет 					= Истина;
	НовыйПозиция.Дата 						= ТекСмета.Дата;
	НовыйПозиция.ИДРодителя 				= ТекРаздел.Ссылка;
	НовыйПозиция.ИДСметы 					= ТекРаздел.ИДСметы;
	НовыйПозиция.ИДПозицииВладельца			= ТекПозиция;
	НовыйПозиция.ШифрРасценки 				= СтрокаПозиции.КодРесурса;
	НовыйПозиция.Наименование 				= СтрокаПозиции.Наименование;
	НовыйПозиция.НормаРасходаРесурса 		= СтрокаПозиции.НормаРасхода;
	НовыйПозиция.ОбъемРабот 				= СтрокаПозиции.ОбъемРаботПозиции;
	НовыйПозиция.ФормулаОбъема				= СтрокаПозиции.ФормулаОбъема;
	НовыйПозиция.ТипНормативныхСборников	= Перечисления.СМ_ТипыНормативныхСборников.СметныеЦеныНаМатериалы;
	НовыйПозиция.Определитель 				= Справочники.СМ_Определители.НайтиПоТипуНормативногоСборника(НовыйПозиция.ТипНормативныхСборников);
	НовыйПозиция.Измеритель 				= СтрокаПозиции.Измеритель;
	НовыйПозиция.ЕдиницаИзмерения 			= СМ_СметаВызовСервера.НайтиЕдиницуИзмеренияПоСтроке(СтрокаПозиции.Измеритель);
	НовыйПозиция.СпособСоздания  			= Перечисления.СМ_ИсточникиДобавленияПозиций.Загружена;
	НовыйПозиция.ИсточникСоздания   		= "Гектор5D#XML";
	НовыйПозиция.Примечание					= СтрокаПозиции.БазовыйКод;
	НовыйПозиция.КоличествоРесурса 			= 0;	
	
	Если ТекПозиция.Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Материал ИЛИ 
		 ТекПозиция.Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Оборудование Тогда
		НовыйПозиция.НормаРасходаРесурса 	= 1;
		НовыйПозиция.КоличествоРесурса 		= НовыйПозиция.ОбъемРабот / НовыйПозиция.НормаРасходаРесурса;
	Иначе
		Если НовыйПозиция.НормаРасходаРесурса > 0 Тогда
			НовыйПозиция.КоличествоРесурса 	= НовыйПозиция.ОбъемРабот / НовыйПозиция.НормаРасходаРесурса; 
		КонецЕсли;
	КонецЕсли;
	НовыйПозиция.Записать();
	
	// Запись в массив сообщений
	ТекстСообщения = "Создана подчиненная позиция - " + Строка(НовыйПозиция);
	СтруктураДанных.МассивСообщений.Добавить(ТекстСообщения);
	
КонецПроцедуры

Функция ПолучитьШифрПозицииЛС(ТекШифр)
	
	СтруктураШифра = Новый Структура;
	СтруктураШифра.Вставить("Шифр","");
	СтруктураШифра.Вставить("Префикс","");
	ТекСтрока = ТекШифр;
	Пока СтрДлина(ТекСтрока) > 0 Цикл
		ТекСимвол = Лев(ТекСтрока,1);
		ТекПозиция = Найти("0123456789",ТекСимвол);
		Если ТекПозиция > 0 Тогда
			СтруктураШифра.Шифр = ТекСтрока;
			Возврат СтруктураШифра;
		Иначе	
			СтруктураШифра.Префикс = СтруктураШифра.Префикс + ТекСимвол;				
		КонецЕсли;
		ТекСтрока = Сред(ТекСтрока,2);	
	КонецЦикла;
	
	Возврат СтруктураШифра;
	
КонецФункции

Процедура СоздатьКонструктив(СтрокаКонструкции,Стройка)
	
	НазваниеКатегории 	= СМ_BIM_ВызовСервера.ПреобразоватьИмяКонструктива(СтрокаКонструкции.НаименованиеКатегории); 
	ТипКонструктива 	= СМ_BIM_ВызовСервера.НайтиСоздатьТипКонструктива(НазваниеКатегории);
	НайденныйЭлемент 	= Справочники.УСОERP_Конструктив.НайтиПоНаименованию(СтрокаКонструкции.ИдТипа,Истина,,Стройка);	
	НайденныйРодитель	= Справочники.УСОERP_Конструктив.НайтиПоНаименованию(СтрокаКонструкции.ИдРодителя,Истина,,Стройка);	
	
	Если НайденныйЭлемент = Справочники.УСОERP_Конструктив.ПустаяСсылка() Тогда
		НовыйЭлемент 						= Справочники.УСОERP_Конструктив.СоздатьЭлемент();
		НовыйЭлемент.Наименование           = СтрокаКонструкции.ИдТипа;
		НовыйЭлемент.ТипКонструктива        = ТипКонструктива;
		НовыйЭлемент.Владелец               = Стройка;
		НовыйЭлемент.НаименованиеПолное     = СтрокаКонструкции.НаименованиеТипа;
		НовыйЭлемент.Родитель				= НайденныйРодитель;
		НовыйЭлемент.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
